{
    "filter": "Filters :",
    "linktext": "Go to the project",
    "projects":[
        {
            "title": "3D Editor",
            "desc":[
              "A simple 3D editor to create base 3D and 2D shapes, modify their scale, position and rotation.",
              "This editor allows you to keep the shape separated in different independant zones and manage them in group to modify more than one shape at a time.",
              "The project was done using C++ thanks to the Irrlicht library to handle the 3D."
            ],
            "link": "https://github.com/Aztyu/Editeur-3D",
            "image": "editeur3D",
            "category": "cpp"
        },
        {
            "title": "My Resume",
            "link": "https://github.com/Aztyu/PolymerCV",
            "image": "polymercv",
            "desc":[
                "This website is my own website where I keep my resume up to date and have a small portfolio page, it allowed me to experiment freely with new technologies.",
                "I used Polymer 1.0 which use web components to easily create this website, keeping it responsive and material design."
            ],
            "category": "web"
        },
        {
            "title": "Codeine10",
            "link": "http://codeine10.science/",
            "image": "codeine10",
            "desc":[
                "Codeine10 was created with Wordpress for a school assignement about SEO optimization.",
                "The main focus was putting the site on a great position on search engines, not developing the best site.",
                "In order to obtain the best results, we wrote interesting articles and tried to stay coherent with keywords."
            ],
            "category": "seo"
        },
        {
          "title": "Todo list",
          "link": "https://github.com/Aztyu/TodoJava",
          "image": "todolist",
          "desc":[
              "This Java program allows user to create task/bug and then comment on those items or close them.",
              "The user can easily use the program made in Java thanks to the interface created with Swing.",
              "I used a MySQL database to keep every user login and the different tasks/bugs."
          ],
          "category": "java"
        },
        {
            "title": "Restaurant manager",
            "link": "https://github.com/Jitrixis/2NET-Restaurant-Management-Software",
            "image": "restaurant",
            "desc":[
                "This program allows the user to manage a restaurant by adding/modifying/removing meals/waiters/tables in the main interface.",
                "C# with .Net was used to create it, the graphical interface was made in WPF and all the data was managed with Entity Framework and an underlying SQL Server."
            ],
            "category": "csharp"
        },
        {
            "title": "Taxi company",
            "link": "https://github.com/Jitrixis/2NET-Restaurant-Management-Software",
            "image": "taxicsharp",
            "desc":[
                "This software allows the user to manage the driver and trip aspect of a taxi company.",
                "This C# program executes in a console and uses Entity Framework."
            ],
            "category": "csharp"
        },
        {
            "title": "Retro breaker",
            "link": "https://github.com/Aztyu/Retro_Breaker",
            "image": "retrobreaker",
            "desc":[
                "Retro breaker is a remake to the famous brick breaker 'Arkanoid' with a retro/neon look.",
                "On the technical level, I used the C language with the SDL library for the 2D graphics."
            ],
            "category": "cpp"}
    ]
}
