{
    "filter": "Filtres :",
    "linktext": "Accéder au projet",
    "projects":[
        {
            "title": "Editeur 3D",
            "desc":[
              "Un éditeur 3D basique qui permet de créer les formes de bases, de modifier leur taille, leur rotation et leur échelle.",
              "L'éditeur supporte aussi la création de plusieurs zones et de groupes pour gérer plusieurs objets en même temps.",
              "Ce projet a été réalisé en C++ grâce à la bibliothèque Irrlicht."
            ],
            "link": "https://github.com/Aztyu/Editeur-3D",
            "image": "editeur3D",
            "category": "cpp"
        },
        {
            "title": "Mon CV",
            "link": "https://github.com/Aztyu/PolymerCV",
            "image": "polymercv",
            "desc":[
                "Il s'agit de mon site personnel qui a pour but de servir de CV et portfolio tout en me permettant d'expérimenter de nouvelles technologies.",
                "J'ai utilisé la technologie Polymer de Google, basée sur les web components, afin d'obtenir un site responsive et material design."
            ],
            "category": "web"
        },
        {
            "title": "Codeine10",
            "link": "http://codeine10.science/",
            "image": "codeine10",
            "desc":[
                "Ce site Wordpress a été crée dans le cadre d'un projet SUPINFO sur l'optimisation de site Web pour les moteurs de recherches.",
                "Le but était de placer le site en bonne position sur les moteurs de recherche grâce à diverses techniques et un bon contenu."
            ],
            "category": "seo"
        },
        {
          "title": "Todo list",
          "link": "https://github.com/Aztyu/TodoJava",
          "image": "todolist",
          "desc":[
              "Ce programme permet de se connecter et de créer des tâches, il est ensuite possible de commenter ces tâches ou de les terminer.",
              "Le programme a été entièrement réalisé en Java avec Swing pour l'interface et une base de données MySQL pour sauvegarder les tâches et utilisateurs."
          ],
          "category": "java"
        },
        {
            "title": "Gestionnaire de restaurant",
            "link": "https://github.com/Jitrixis/2NET-Restaurant-Management-Software",
            "image": "restaurant",
            "desc":[
                "Un logiciel qui permet de gérer un restaurant en ajoutant des repas et serveurs puis de les assigner aux différentes tables.",
                "Le C# a été utilisé pour créer le programme en WPF et LINQ pour gérer la liaison avec la base de donnée."
            ],
            "category": "csharp"
        },
        {
            "title": "Gestionnaire de taxi",
            "link": "https://github.com/Jitrixis/2NET-Restaurant-Management-Software",
            "image": "taxicsharp",
            "desc":[
                "Un logiciel qui permet de gérer une compagnie de taxi en ajoutant des chauffeurs et trajets.",
                "Le programme s'exécute en mode console et a été programmé en C#."
            ],
            "category": "csharp"
        },
        {
            "title": "Retro breaker",
            "link": "https://github.com/Aztyu/Retro_Breaker",
            "image": "retrobreaker",
            "desc":[
              "Retro breaker est un remake du célébre jeu de casse-brique 'Arkanoid' avec un look rétro/néon.",
              "Au niveau technique, le C a été utilisé avec la bibliothèque SDL pour l'affichage."
            ],
            "category": "cpp"}
    ]
}
